from ..utils import *

class DMF_083:
    """ 踊るコブラ
    <b>変妖:</b>
<b>猛毒</b>を獲得する。 """
    #
    pass

class DMF_083t:
    """ 踊るコブラ
    <b>変妖態</b>
<b>猛毒</b> """
    #
    pass

class DMF_084:
    """ ン＝ゾスの魔石
    [x]この対戦で死亡した
味方の<b>断末魔</b>ミニオン
を3体まで召喚する。 """
    #
    pass

class DMF_085:
    """ ダークムーンのトンク
    <b>断末魔:</b>
2ダメージを与える矢を
4本放ち、敵にランダムに振り分ける。 """
    #
    pass

class DMF_086:
    """ ふれあい動物園
    [x]3/3のストライダー
を1体召喚する。自分が
準備している<b>秘策</b>の
数だけ繰り返す。 """
    #
    pass

class DMF_087:
    """ 踏み潰すサイ
    [x]<b>急襲</b>
このミニオンの攻撃で
ミニオンが死亡した後
余剰ダメージを敵の
ヒーローに与える。 """
    #
    pass

class DMF_088:
    """ リンリングのライフル
    [x]自分のヒーローが
攻撃した後
<b>秘策</b>を1つ<b>発見</b>して
準備する。 """
    #
    pass

class DMF_089:
    """ マキシマ・ブラステンハイマー
    [x]<b>雄叫び:</b>
自分のデッキから
ミニオンを1体召喚する。
それは敵のヒーローを
攻撃してから死ぬ。 """
    #
    pass

class DMF_090:
    """ エサをあげないでね
    [x]自分の手札の獣全てに
+1/+1を付与する。
<b>変妖:</b>_代わりに
+2/+2を付与する。 """
    #
    pass

class DMF_090t:
    """ エサをあげないでね
    <b>変妖態</b>
自分の手札の獣
全てに+2/+2を
付与する。 """
    #
    pass

class DMF_122:
    """ 秘密の景品の当選者
    [x]<b>雄叫び:</b>
_<b>秘策</b>を1枚<b>発見</b>する。 """
    #
    pass

class DMF_123:
    """ 檻が開く
    [x]<b>秘策:</b>
自分のターンの開始時に
自陣にミニオンが
2体いる場合、獣の相棒を
1体召喚する。 """
    #
    pass

class YOP_027:
    """ ボーラ・ヴォレイ
    ミニオン1体に$1ダメージを与え
隣接するミニオンに
$2ダメージを与える。 """
    #
    pass

class YOP_028:
    """ 鞍職人
    [x]自分が手札から
獣を使用した後
ランダムな獣1体を自分の
手札に追加する。 """
    #
    pass

class YOP_029:
    """ 伸縮自在ポーチ
    [x]自分の残りの
マナクリスタルの数に
等しいコストのカード
を1枚<b>発見</b>する。 """
    #
    pass

class YOP_030:
    """ フェルファイアの射手
    [x]自分のヒーローパワー
のコストが（1）減る。 """
    #
    pass

