from ..utils import *

class SW_037:
    """ 怒縛の暴れん坊
    [x]<b>挑発</b>
このターンに引いた
カード1枚につき
____コストが（1）減る。_ """
    #
    pass

class SW_039:
    """ 最後の決闘
    [x]<b>連続クエスト:</b>
1ターン中に
カードを4枚引く。
<b>報酬:</b>_引いた4枚のカード
のコストが（1）減る。 """
    #
    pass

class SW_040:
    """ フェル連射
    [x]2回、最も体力が
低い敵1体に
$2ダメージを与える。 """
    #
    pass

class SW_041:
    """ 敏速の秘印
    [x]次の自分のターンの
開始時、カードを
1枚引きそのコストを
（1）減らす。 """
    #
    pass

class SW_042:
    """ しつこい商売人
    [x]<b>交換可</b>、<b>断末魔:</b>
自分のデッキから
「しつこい商売人」
__を1体召喚する。 """
    #
    pass

class SW_043:
    """ フェル喰らい
    [x]<b>雄叫び:</b>
フェル呪文を1枚引く。
そのコストを
（2）減らす。 """
    #
    pass

class SW_044:
    """ ジェイス・ダークウィーヴァー
    [x]<b>雄叫び:</b>
この対戦で自分が使用した
フェル呪文を全て
使用する<i>（可能な限り
敵を標的にする）</i>。 """
    #
    pass

class SW_451:
    """ 悪魔変フィン
    [x]<b>挑発</b>、<b>雄叫び:</b>
このターンに自分が
フェル呪文を使っていた場合
+2/+2を獲得する。 """
    #
    pass

class SW_452:
    """ 混沌吸血
    [x]<b>生命奪取</b>
ミニオン1体に
$3ダメージを与える。
<b>異端:</b>_代わりに
$5ダメージを与える。 """
    #
    pass

class SW_454:
    """ 獅子奮刃
    [x]自分がこのターンに
引いたカードの
枚数に等しい
__攻撃力を得る。 """
    #
    pass
