from ..utils import *


class SW_320:
    """ 桁外れな数のネズミ
    [x]1/1の「ネズミ」を
7体召喚する。
自陣に収まらない分は
手札になり+4/+4を得る。 """
    #
    pass

class SW_321:
    """ 狙い撃ち
    [x]$3ダメージを与える。
自分が次に使用する
ヒーローパワーの与える
ダメージが2増える。 """
    #
    pass

class SW_322:
    """ ドワーフ地区の防衛
    [x]<b>連続クエスト:</b>
2つの呪文で
ダメージを与える。
<b>報酬:</b>_自分のヒーローパワー
がミニオンを標的にできる。 """
    #
    pass

class SW_323:
    """ ネズミの王
    [x]<b>急襲</b>
<b>断末魔:</b>_<b>休眠状態</b>になる。
味方のミニオンが5体
__死んだ後、復活する。 """
    #
    pass

class SW_455:
    """ ネズミの巣窟
    [x]<b>断末魔:</b>
1/1の「ネズミ」を
5匹召喚する。 """
    #
    pass

class SW_457:
    """ 革細工キット
    [x]味方の獣が3体死んだ後
獣を1体引き
+1/+1を付与する。
耐久度を1失う。 """
    #
    pass

class SW_458:
    """ 衝角の乗騎
    [x]ミニオン1体に
+2/+2と攻撃する際は
<b>無敵</b>を付与する。
そのミニオンの死亡時
_雄羊を1体召喚する。 """
    #
    pass

class SW_459:
    """ ストームウィンドの笛吹き
    [x]このミニオンが
攻撃した後
味方の獣全てに
____+1/+1を付与する。 """
    #
    pass

class SW_460:
    """ 貪り食う大群
    [x]敵のミニオン1体を
選択する。味方のミニオン
全てがそれを攻撃し
死んだ味方は
自分の手札に戻る。 """
    #
    pass

class SW_463:
    """ 輸入タランチュラ
    [x]<b>交換可</b>、<b>断末魔:</b>
<b>猛毒</b>と<b>急襲</b>を持つ
1/1のクモを
2体召喚する。 """
    #
    pass
