from ..utils import *

class SW_001:
    """ 星界インクセット
    [x]呪文のために5マナ
消費した後、自分の
手札の呪文1枚のコスト
を（5）減らす。
耐久度を1失う。 """
    #
    pass

class SW_107:
    """ 焼け残り特売
    [x]<b>交換可</b>
全てのミニオンに
___$3ダメージを与える。 """
    #
    pass

class SW_108:
    """ 一の炎
    [x]ミニオン1体に
$2ダメージを与える。
「二の炎」を自分の
手札に追加する。 """
    #
    pass

class SW_109:
    """ ふらついた配達人
    [x]<b>雄叫び:</b>
自分の手札の
最もコストが高い
___呪文を使用する。 """
    #
    pass

class SW_110:
    """ 火付け
    [x]$@ダメージを与える。
自分のデッキに
ダメージが1大きい
「火付け」1枚を混ぜる。 """
    #
    pass

class SW_111:
    """ 聖域の灯火係
    [x]自分が火炎呪文を
使った後
___呪文を1枚引く。 """
    #
    pass

class SW_112:
    """ プレスターの火霊術師
    [x]<b>雄叫び:</b>
自分が次に使用する
火炎呪文は
<b>____呪文ダメージ+2</b>を得る。 """
    #
    pass

class SW_113:
    """ 大魔導士アントニダス
    [x]<b>雄叫び:</b>
自分が直前の3ターンそれぞれ
で火炎呪文を使っていたら
「ファイアーボール」3発を
ランダムな敵に振り分ける。
<i>（@/3）</i> """
    #
    pass

class SW_450:
    """ 魔法使いの策
    [x]<b>連続クエスト:</b>
火炎、凍気、魔力呪文
を１つずつ使う。
____<b>報酬: </b>呪文を1枚引く。_ """
    #
    pass

class SW_462:
    """ 予熱
    [x]このターン
自分が次に使用する
火炎呪文のコスト
は（2）減る。 """
    #
    pass

class SW_462e:
    """ 予熱
    自分が次に手札から使用する火炎呪文のコストが（2）減る。 """
    #
    pass

