from ..utils import *

class SW_006:
    """ だんまりのチンピラ
    [x]<b>断末魔:</b>
ランダムなコスト3の
ミニオン1体を
召喚する。 """
    #
    pass

class SW_036:
    """ 双頭の投資家
    [x]自分のターンの終了時
自分の手札1枚のコストを
（1）減らす。<i>（50%の
__確率で逆に増える）</i> """
    #
    pass

class SW_045:
    """ 競売人ジャクソン
    [x]自分が<b>交換</b>する度
カードを引く代わりに
自分のデッキから
1枚<b>発見</b>する。 """
    #
    pass

class SW_054:
    """ ストームウィンドの衛兵
    [x]<b>挑発</b>、<b>雄叫び:</b>
隣接するミニオンに
__+1/+1を付与する。 """
    #
    pass

class SW_055:
    """ 短気な店主
    <b>交換可</b>、<b>急襲</b> """
    #
    pass

class SW_056:
    """ スパイスブレッド職人
    [x]<b>雄叫び:</b>
自分のヒーローの体力を
自分の手札の枚数分
回復する。 """
    #
    pass

class SW_057:
    """ 早飛脚
    [x]自分の手札が
8枚以上の時のみ
___攻撃できる。 """
    #
    pass

class SW_059:
    """ ディープラン・エンジニア
    [x]<b>雄叫び:</b>
メカを1体<b>発見</b>する。
そのコストは
（1）減る。 """
    #
    pass

class SW_060:
    """ お花屋さん
    [x]自分のターンの終了時
自分の手札の
自然呪文1つのコスト
を（1）減らす。 """
    #
    pass

class SW_061:
    """ ギルドの商人
    [x]<b>交換可</b>
<b>呪文ダメージ+2</b> """
    #
    pass

class SW_062:
    """ ゴールドシャイアのノール
    [x]<b>急襲</b>
このカード以外の
自分の手札1枚につき
____コストが（1）減る。_ """
    #
    pass

class SW_063:
    """ バトルグラウンドのバトルマスター
    [x]隣接するミニオンは
<b>疾風</b>を得る。 """
    #
    pass

class SW_064:
    """ ノースシャイアの農夫
    [x]<b>雄叫び:</b>
__味方の獣1体を選択する。
その3/3のコピー3体を
___自分のデッキに混ぜる。_ """
    #
    pass

class SW_065:
    """ パンダレンの輸入業者
    [x]<b>雄叫び:</b>
対戦開始時に自分の
デッキに入っていなかった
呪文を1つ<b>発見</b>する。 """
    #
    pass

class SW_066:
    """ 王立図書館の司書
    [x]<b>交換可</b>、<b>雄叫び:</b>
ミニオン1体を
<b>沈黙</b>させる。 """
    #
    pass

class SW_067:
    """ 監獄の衛兵
    [x]<b>雄叫び:</b>
味方のミニオン1体に
<b>挑発</b>を付与する。 """
    #
    pass

class SW_068:
    """ モアーグの鍛冶鬼
    [x]<b>挑発</b>、<b>断末魔:</b>
装甲を8獲得する。 """
    #
    pass

class SW_069:
    """ 勤勉な銀行家
    [x]自分のターンの終了時
自分のデッキから
カードを1枚預かる。
<b>断末魔:</b>_預けたカード全てを
______自分の手札に追加する。_ """
    #
    pass

class SW_070:
    """ ポスト乗り乗りダンサー
    [x]<b>雄叫び:</b>
「コイン」1枚を__
自分の手札に追加する。
<b>断末魔:</b>_相手に「コイン」
1枚を与える。 """
    #
    pass

class SW_071:
    """ 獅子近衛兵
    [x]<b>雄叫び:</b>
自分のヒーローの体力が
15以下の場合、+2/+4と
<b>挑発</b>を獲得する。 """
    #
    pass

class SW_072:
    """ 腐り錆びのクサリヘビ
    [x]<b>交換可</b>、<b>雄叫び:</b>
__敵の武器を破壊する。 """
    #
    pass

class SW_073:
    """ チーズ屋さん
    [x]相手が呪文を使う度
同コストのランダムな
呪文1枚を自分の
__手札に追加する。 """
    #
    pass

class SW_074:
    """ 貴族さま
    [x]<b>雄叫び:</b>
自分のランダムな
手札1枚のゴールデンの
__コピーを1枚作る。 """
    #
    pass

class SW_075:
    """ エルウィンのイノシシ
    [x]<b>断末魔:</b>
自分がこの対戦で「エルウィン
のイノシシ」を7体死なせて
いたら15/3の「千の真実の剣」
を装備する。@<i>（@/7体）</i> """
    #
    pass

class SW_076:
    """ 都市建築家
    [x]<b>雄叫び:</b>
<b>挑発</b>を持つ
0/5の「城壁」を
___2体召喚する。 """
    #
    pass

class SW_077:
    """ 監獄の囚人
    [x]最初は<b>休眠状態</b>。
自分がカードを3枚
手札から使用した後
___これは目覚める。 """
    #
    pass

class SW_078:
    """ レディ・プレスター
    <b>雄叫び:</b>
自分のデッキのミニオン
全てをランダムな
ドラゴンに変身させる。
<i>（ただし攻撃力、体力、
コストは元のまま）</I> """
    #
    pass

class SW_079:
    """ フライトマスター・ダンガー
    [x]<b>雄叫び:</b>
航路を1つ選択し
<b>休眠状態</b>になる。
到着時にボーナスを得て
目覚める！ """
    #
    pass

class SW_080:
    """ コーネリアス・ローム
    [x]各プレイヤーのターンの
開始時と終了時
___カードを1枚引く。 """
    #
    pass

class SW_081:
    """ ストームウィンド王ヴァリアン
    [x]<b>雄叫び:</b>
<b>急襲</b>ミニオンを1体引き、
引けたら<b>急襲</b>を獲得する。
<b>挑発</b>、<b>聖なる盾</b>
___についても繰り返す。 """
    #
    pass

class SW_306:
    """ 重荷運びラバ
    [x]<b>挑発</b>
自分がこれを引いた時
コピー1体を自分の
手札に追加する。 """
    #
    pass

class SW_307:
    """ 旅商人
    [x]<b>交換可</b>、<b>雄叫び:</b>
自身を除く味方の
ミニオン1体につき
____+1/+1を獲得する。_ """
    #
    pass

class SW_319:
    """ 土木作業員
    [x]自分のターンの開始時
カードを1枚引く。 """
    #
    pass

class SW_400:
    """ 囚われの女魔術師
    [x]<b>雄叫び:</b>
自分が<b>クエスト</b>中の場合
呪文を1つ<b>発見</b>する。 """
    #
    pass

class SW_418:
    """ SI:7密偵
    [x]<b>隠れ身</b>、<b>雄叫び:</b>
自分が次に引くカードの
コストが（1）減る。 """
    #
    pass
