from ..utils import *

class SW_046:
    """ 市税
    [x]<b>交換可</b>、<b>生命奪取</b>
敵のミニオン全てに
$1ダメージを与える。 """
    #
    pass

class SW_047:
    """ 騎士団長フォードラゴン
    [x]<b>聖なる盾</b>
味方のミニオンが
<b>聖なる盾</b>を失った後
自分の手札のミニオン
____1体に+5/+5を付与する。_ """
    #
    pass

class SW_048:
    """ プリズム宝石細工キット
    [x]味方のミニオンが
<b>聖なる盾</b>を失った後
自分の手札のミニオン全てに
+1/+1を付与する。
耐久度を1失う。 """
    #
    pass

class SW_049:
    """ 祝福グッズ
    [x]<b>秘策</b>、武器、または
<b>聖なる盾</b>ミニオンを
1つ<b>発見</b>する。 """
    #
    pass

class SW_305:
    """ リン王室筆頭剣士
    [x]<b>聖なる盾</b>、<b>雄叫び:</b>
これの攻撃力が
4以上の場合
___<b>急襲</b>を獲得する。 """
    #
    pass

class SW_313:
    """ いざストームウィンド
    [x]<b>連続クエスト:</b>
コスト1のカードを3種類
手札から使用する。
<b>報酬:</b>_1/4の
「ライツ・ジャスティス」
を装備 """
    #
    pass

class SW_314:
    """ ライトブリンガーの鎚
    [x]<b>生命奪取</b>
ヒーローを
__攻撃できない。 """
    #
    pass

class SW_315:
    """ アライアンスの旗持ち
    [x]<b>雄叫び:</b>
ミニオンを1体引く。
自分の手札のミニオン全てに
+1/+1を付与する。 """
    #
    pass

class SW_316:
    """ 貴族の乗騎
    [x]ミニオン1体に+1/+1と
<b>聖なる盾</b>を付与する。
そのミニオンの死亡時
___戦馬を1体召喚する。 """
    #
    pass

class SW_317:
    """ 地下墓所の衛兵
    [x]<b>生命奪取</b>、<b>雄叫び:</b>
敵のミニオン1体に
このミニオンの攻撃力に
___等しいダメージを与える。 """
    #
    pass
